MusicApp/app/views/bands/index.html.erb

SELECT "bands".* FROM "bands"
---
<ol>
    <% Band.all.each  do |band|%>