MusicApp/app/views/bands/show.html.erb

SELECT albums.* FROM "bands" INNER JOIN "albums" ON "albums"."band_id" = "bands"."id" WHERE (bands.id = 3)
---
<li>
    <% Band.select('albums.*').joins(:albums).where('bands.id = ?',@band.id).each do |album| %>