MusicApp/app/controllers/albums_controller.rb

INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 1], ["title", "Is This It"], ["year", 2001], ["created_at", "2022-07-06 21:22:02.436481"], ["updated_at", "2022-07-06 21:22:02.436481"]]
---
    def create
        @album = Album.new(album_params)
        @album.band_id = @album.band_id.to_i
        @album.live = to_boolean(@album.live)
        p @album
        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def update
        @album = Album.find(params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @album = Album.find(params[:id])