MusicApp/app/controllers/bands_controller.rb

    def show
        @band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @band = Band.new(band_params)

        if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Little Ones"], ["created_at", "2022-07-06 19:22:51.864034"], ["updated_at", "2022-07-06 19:22:51.864034"]]

    def edit
        @band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
        @band = Band.find(params[:id])
        if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "David Guetta"], ["updated_at", "2022-07-06 21:04:19.304972"], ["id", 2]]

    def destroy
        @band = Band.find(params[:id])
        @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 4]]