MusicApp/app/views/albums/index.html.erb

<ol>
    <% Album.all.each  do |album|%>
---
SELECT "albums".* FROM "albums"