MusicApp/app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "p91QyFUP2Xcpena-AjtKow"], ["updated_at", "2022-07-06 18:16:40.728317"], ["id", 1]]